test/download.xml

<soapenv:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:cwmp="urn:dslforum-org:cwmp-1-0" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"><soapenv:Header><cwmp:ID soapenv:mustUnderstand="1">2</cwmp:ID></soapenv:Header><soapenv:Body><cwmp:Download><CommandKey xsi:type="xsd:string">FirmwareUpgrade</CommandKey><FileType xsi:type="xsd:string">1 Firmware Upgrade Image</FileType><URL xsi:type="xsd:string">http://192.168.1.100/firmware.img</URL><Username xsi:type="xsd:string">acsrs</Username><Password xsi:type="xsd:string">acsrs</Password><FileSize xsi:type="xsd:long">64000000</FileSize><TargetFileName xsi:type="xsd:string">firmware.img</TargetFileName><DelaySeconds xsi:type="xsd:int">0</DelaySeconds><SuccessURL xsi:type="xsd:string">success</SuccessURL><FailureURL xsi:type="xsd:string">failure</FailureURL></cwmp:Download></soapenv:Body></soapenv:Envelope>

